public/sapico/ZF_Revenue_AGGPB-20251102.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <dws:setTransaction xmlns:dws="http://dwssync_pfi_qa" xmlns:xsd="http://dwssync_pfi_qa/xsd">
      <dws:input>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZF</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZF20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>01</xsd:BSCHL>
          <xsd:NEWKO>5000000000</xsd:NEWKO>
          <xsd:WRBTR>0</xsd:WRBTR>
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGGPB</xsd:ZUONR>  <!-- ✅ Changed to AGGPB -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD></xsd:WWPRD>
          <xsd:KUNNR>5000000000</xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGGREGATOR</xsd:SGTXT>  <!-- ✅ Changed text -->
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZF</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZF20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>50</xsd:BSCHL>
          <xsd:NEWKO>4100220000</xsd:NEWKO>  <!-- ✅ Changed COA for ZF -->
          <xsd:WRBTR>0</xsd:WRBTR>  <!-- ✅ Individual amount -->
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGGPB</xsd:ZUONR>  <!-- ✅ AGGPB -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD>12200111</xsd:WWPRD>  <!-- ✅ Different WWPRD -->
          <xsd:KUNNR></xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGGREGATOR</xsd:SGTXT>  <!-- ✅ Changed text -->
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZF</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZF20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>50</xsd:BSCHL>
          <xsd:NEWKO>4100220000</xsd:NEWKO>  <!-- ✅ Changed COA for ZF -->
          <xsd:WRBTR>0</xsd:WRBTR>  <!-- ✅ Individual amount -->
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGGPB</xsd:ZUONR>  <!-- ✅ AGGPB -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD>12200111</xsd:WWPRD>  <!-- ✅ Different WWPRD -->
          <xsd:KUNNR></xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGGREGATOR</xsd:SGTXT>  <!-- ✅ Changed text -->
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZF</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZF20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>50</xsd:BSCHL>
          <xsd:NEWKO>4100220000</xsd:NEWKO>  <!-- ✅ Changed COA for ZF -->
          <xsd:WRBTR>0</xsd:WRBTR>  <!-- ✅ Individual amount -->
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGGPB</xsd:ZUONR>  <!-- ✅ AGGPB -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD>12200111</xsd:WWPRD>  <!-- ✅ Different WWPRD -->
          <xsd:KUNNR></xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGGREGATOR</xsd:SGTXT>  <!-- ✅ Changed text -->
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
      </dws:input>
      <dws:type>JSON</dws:type>
    </dws:setTransaction>
  </soapenv:Body>
</soapenv:Envelope>